package com.lemonclient.client.module.modules.qwq;

import com.lemonclient.api.setting.values.BooleanSetting;
import com.lemonclient.api.setting.values.IntegerSetting;
import com.lemonclient.api.util.misc.MessageBus;
import com.lemonclient.client.module.Category;
import com.lemonclient.client.module.Module;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.Random;

@Module.Declaration(
   name = "FriendlyModule",
   category = Category.qwq
)
public class FriendlyModule extends Module {
   BooleanSetting bad = this.registerBoolean("Bad Words", false);
   IntegerSetting delay = this.registerInteger("Delay", 1, 0, 200);
   BooleanSetting antiSpam = this.registerBoolean("Anti Spam", false);
   int waited;
   String lastMeme = "";
   String lastMeme2 = "";
   String lastMeme3 = "";
   String lastMeme4 = "";
   String lastMeme5 = "";
   public static ArrayList<String> penshen = new ArrayList(Arrays.asList("这么嚣张，是有动物保护协会撑腰吗？", "英文名叫CtrlC还CtrlV啊？这么爱学人", "愿病魔早日战胜你全家", "知道你是个直肠子，但你也不能用嘴拉吧", "看您说话这逻辑，直肠通大脑吧", "人类进化的时候，你躲起来了吗", "你要是有病别来找我，我又不是兽医", "你绝对是你妈亲生的，不然你妈怎么会养你这么个混账东西！", "你玩劈腿，劈那么开，不怕蛋蛋受凉啊?", "等我有钱了，我就带你去最好的精神病院。", "上帝失手摔下来的旧洗衣机，能思考的无脑袋生物", "我也不想打击你了。你去动物园看看有没有适合的工作适合你，你这样在街上乱跑很容易被警察射杀的。", "拿你当人的时后，你尽量装的像点好吗。", "看到了你，我突然就明白了毕加索是个怎样的存在。", "你妈生你那天，你一个爹都没来", "你丑的我都失去知觉了", "我打了狂犬疫苗，你以为我会怕你？", "虽然你傻逼，但你在做自己，为你感到开心", "如果不能说脏话，那我对你也没话可说", "别跟我说话，我有洁癖", "今天想骂人，所以不骂你", "你们家都是你做饭吧，我看你挺会添油加醋的", "我是算命的，请问您算什么东西？", "绳子太长会打结，你的舌头咋不能呢？", "祝你的婚礼越办越好", "你是亚里士多德的妹妹，珍妮玛士多吗", "用一句话形容你吧，人面不知何处去", "今夜的风有点大，不知道你棺材漏不漏风", "以后你儿孙满堂，全靠兄弟帮忙", "看你挺凶的，我的QQ农场缺条狗，明天来上班吧", "您配钥匙吗？您配吗？您配几把？", "那么喜欢装逼，当内裤算了", "祝您寿比昙花", "真羡慕你的皮肤，保养的这么厚", "你一来，我这一锅粥都不能要了", "每当想起你，我的中指就忍不住勃起", "装GPS了吗？清楚自己的定位吗？", "大夫说你这病，从眉毛往下都得截肢", "你要好好做自己，反正别的你也做不好", "草船上借的不就是你吗？", "我有密集恐惧症，不能接近心眼子多的人", "我学会了和畜生沟通，我们终于可以聊天啦", "刚才听到粪车爆炸了，原来是你开口说话了", "我和你比也就多张脸 ", "这么喜欢到处认儿子，是没有生育能力？", "你的脖子真可爱，上面顶个猪脑袋", "你是古玩城老板吗？见谁都叫宝贝", "你是什么品种的猪怎么这么凶", "你长脑袋只是为了让自己看起来高点么", "为什么不和我说话？是因为你不配吗？", "你的长相很提神", "你真聪明，居然还知道自己是个人", "吃亏是福，我祝你，福如东海", "你瞅你那五官，各长各的，谁都不服谁", "哪个下水道没盖好，又让你爬出来了", "你的戏可以像你的钱一样少吗?", "你是什么牌子塑料袋，这么能装", "你不去当厨子可惜了，甩锅甩的那么厉害", "你是一条酸菜鱼，又酸又菜又多鱼", "我不想知道你有病，别表现的这么明显好吗", "都是我的错，又把你当人看了。", "你那么厉害，一定是自己一个人长大的吧？", "我可不敢碰您，我家的洗手液前两天用完了。", "请你不要和我谈人生，因为你压根就不是人生的。", "每次看到路边的垃圾，我总能想起你。", "我把你当朋友，你怎么可以把我当父亲？", "头条搜索不到你，可以试试搜狗。", "你说话那么好听，上厕所一定擦过嘴了。", "你就是我键盘上字母A与D和V与N之间那两个字母。", "请问你是什么牌子的计算机，那么会算计。", "少吃点盐，看您闲的。", "你鸡窝里的石头，混蛋一个。", "如果没有你，谁来衬托他们的美。", "没想到你这年纪轻轻的，就懂得用脸吓唬人了。", "您家户口本翻开就是一本动物百科。", "你这是老太太喝稀粥，无耻又下流。", "马桶里点灯，搁着找屎。", "你是第一次做人吧，没什么经验，完美避开了人该有的样子。", "这位妹妹可有上过学？现在吃什么药？", "我好像在哪里见过你，你是在山海经的哪一页？", "原来身残志坚是您这模样，受教了。", "真羡慕你，自拍就是全家福，团圆饭一人就能吃了。", "令堂给你这张脸就是防止你早恋。", "你长得就跟二维码似的，不扫一扫都不知道是个什么东西。", "长城要是用你脸皮做，孟姜女能哭倒才怪。", "你身材真好，肥而不腻。", "你就像个苦瓜，穿的清凉长的败火。", "祝你吃饭有人喂，走路有人推。", "你可真是癞蛤蟆装青蛙，长的丑玩的花。", "您上辈子是缝纫机吗，这么会拉踩。", "您抓周拿的是键盘？", "有空一起去吃鱼吧，我看你挺会挑刺的。", "你是阿基米德的后代吧，这么会抬杠。", "你这么自信是因为愚蠢吗？", "你好厉害啊，一定是自己长大的吧。", "作为失败的典型，你真的很成功！", "你的俗是骨子里的吧？开水都烫都烫不掉。", "现在都要做垃圾分类了，你自觉点，去你该去的桶。", "你长的真有创意，活的很有勇气。", "你离我远点，我可不想有人举报我虐待动物。", "咋地，猪肉涨价你就飘了啊？", "山海经是你家族历史吧。", "天气凉了，多盖点土。", "令无羌乎？非人哉，非人哉。", "你不是一无所长，在给别人添堵的方面你已经做到登峰造极。", "你爸的枇杷树结的还不错吧？", "你应该在地窖里养点蘑菇，如果没窖养就算了。", "小东西长得真随机。", "上帝把智慧洒满人间，唯独给你撑了把伞。", "最近偷猪的特别多，我有点担心你。", "君有疾在脑，不治恐深。", "吃橘子不，我给你买去。", "孩子多吃点化妆品，增加内在美。", "你要是真的没有镜子可以跟我说的。", "触景生情四个字你占俩。", "是金子总会发光，你说是吧铁子。", "直肠通大脑，减肥减小脑。", "小嘴真甜抹了几瓶开塞露啊？", "披萨反过来就是你啊。", "兵法是用你命名的嘛？", "令慈真是好生欢喜，生出公子这个笑话。", "你的诞生让我明白了基因不一定会遗传。", "你打扮成这样，是对这个世界不满吗？", "刻薄嘴欠和幽默是两回事，别把没教养当做有气场。", "你脑袋空不要紧，关键是不要进水。", "把我想的那么复杂，说明你也好不到哪里。", "国家怎么就没拿你的脸皮研究防弹衣。", "你长个脑袋只是为了让自己看起来更高一点吗。", "人老就罢了，何苦成精。", "前男友有尿毒症吗嘴巴这么毒。", "不把你插到花盆里，你都不知道什么叫植物人。", "你的出生是杜蕾斯的一封道歉信。", "你以为你是铅笔盒啊，装那么多笔。", "你浪费你爸妈一晚上。", "任何人工智能都敌不过阁下这款天然呆。", "你说你吧，没文凭还学人家长得丑，不聪明还学人家秃头顶！", "别人都丑着玩的，你丑得么认真。", "千万别动！你左脑全是水，右脑全是面粉，不动便罢了，一动全是浆糊！", "哪里捡的飘柔让你这么自信。", "东方不亮西方亮，憨批啥样你啥样。", "子不教，父之过，你骂人，我的错。"));
   ArrayList<String> badWords = new ArrayList(Arrays.asList("完全像一个小丑一样被我打的痛苦连连", "你们还真是死皮赖脸的不要皮味", "你神爹我都不想和你说话了", "一个复制机还这么不知道天高地厚", "带着你的废物滚出妖域的视线可以么", "你们这样只会复制到脑里面装不进", "什么优美词语的健忘的脑子的一群亡命匪徒的废柴拿什么和我打", "非想闹个笑话给网络上的人看看你如何的自导自演", "如何的自我安慰吗", "不上台面的小人渣没有词语没有文章的废柴给我滚开好使", "如果你一再挑衅你爹我的耐心不要怪我大义灭亲", "我可以随便的开始把你打的面目全非抛尸街头了", "爹爹警告过你不要一再挑衅我的耐心你不听忠告", "现在我开始对你肆无忌惮的尽情随意殴打你残疾", "让我尽情的开始对你排山倒海的殴打吧废物狗仔", "带着你自以为很有成就的词汇和我一比高下孩子", "你就这样拿出了你所谓的词汇自我安慰是吗孩子", "请你不要拿着三年前不成熟的词汇和我一比高下", "看着你现在的词语逻辑混乱不堪你不觉得害臊吗", "呵呵拿着三年前的词汇胡拼乱凑天下无敌了是吗", "你可以否认你没有文化的事实那么请你拿出实力", "难道你所谓的实力就是低俗不堪自甘下贱是不是", "你那些低俗的语言让你爹爹我埋汰千百次了呵呵", "你看看你三三两两的词汇胡拼乱凑的词语我笑了", "你怎么可以妄自菲薄自称大手窝囊废的存在呵呵", "难道你所谓的速度就是错字连篇词不达意是不是", "你就是只有速度没有词汇胡言乱语盲人骑瞎马了", "呵呵你开始有了脾气呢小伙子你就是窝囊废嘿嘿", "胡言乱语胡乱敲打自以为五项全能是不是窝囊废", "你所谓的大手不过造谣而出你看看你的语言质量", "小伙子面对现实你这样的刚愎自用被人冷眼旁观", "追求速度的过程中你没了文化中国文字被你糟蹋", "作为一个中国人请你不要践踏博大精深的中国字", "你看看你气急败坏的敲打键盘告诉我你倍受打击", "一个个毫无意义的词语出现在我的屏幕深表汗颜", "有本事拿出你的词汇让我心服口服不要自欺欺人", "什么处女膜草泥马的三字经给爹爹我滚远点好使", "不要嘻嘻哈哈的不要脸皮的装腔作势的自不量力", "怎么现在和个市井流氓一样死皮赖脸的不知死活", "你看看你的字里行间有哪一句经过大脑不知廉耻", "你这些惨白无力的反抗被我反驳的所剩无几是吗", "你还在为你仅存的一点点尊严奋死反抗自不量力", "你是不是气急败坏恼羞成怒无言以对了酒囊饭袋", "没有文化的胡乱拼凑毫无逻辑的词语出自你双手", "还要怎么反驳你没有本事没有能耐的真情实相啊", "怎么开始猴急了呢在这样我把你打的抛尸街头了", "怎么妄自菲薄的零零散散的组合这么垃圾的词汇", "你看看你所谓的词汇真的没有什么客观价值了呢", "你还自以为东方不败的词汇无中生有的无端反抗", "你看看你现在恼羞成怒的熊样还说你能超凡脱俗", "你不是自以为是大手可以登峰造极唯我独尊的吗", "为何现在支支吾吾躲躲闪闪的逃避你被打的事实", "我说孩子你这样下去我可不喜欢你了啊可以滚开", "你怎么还是此地无银三百两的间接说你是窝囊废", "呵呵长江后浪推前浪你这样的人注定死在沙滩上", "复制机似的反复那几句没有意义词语很有必要", "看看你现在的样子面目狰狞想忤逆你亲爹是吗", "怎么开始嘻嘻哈哈现在杀了我似的对我充满仇恨", "你以为你那些措辞可以让你爹爹我有所感触是吗", "孩子我告诉你你这些言语我可以随便丢进马桶里", "是不是你就是你爹娘的失败之作你才这样没用的", "你这个天生的废材爹爹我可以把你打到七窍流血", "还有什么堂而皇之的借口反驳你爹爹高高在上啊", "孩子你不要惹是生非爹爹我打得你低三下四了啊", "你开始向我摇尾乞怜让我高抬贵手了废物二卡子", "你的飞扬跋扈不可一世被你苟且偷生的代替了啊", "是不是被我打的不可见人支支吾吾的胡言乱语了", "残缺不全的肢体怎么可以承受住排山倒海的进攻", "自以为是的高傲自大只会被无情的殴打谢绝人世", "你以为你真的才华横溢秒世绝笔了是不是窝囊废", "我现在可以高高在上的说你就是我手下败将呵呵", "你现在所有的话都是胡言乱语躲躲闪闪气急败坏", "你狼狈不堪的继续苟延残喘企图抱住你奄奄一息", "你开始回光返照的继续和我抗争到底了你这孩子", "你看看你现在还有什么脸面继续和我颠倒黑白呢", "狗急跳墙的和我诉说你内心的恐惧与不安是不是", "孩子我真怕你不要性命被我打的心脏心律不齐了", "现在你有没有恼羞成怒告诉我可以吗你这个废物", "心跳加快畏惧你爹爹了是不是你这个不肖子孙啊", "你想向你爹爹我下跪你羞涩难以启齿是不是孩子", "你可以否认你被我打败但是事实你已经气急败坏", "你开始像疯狗一样的对我穷追不放你丧失人性了", "我可以说你是个废物吗你除了颠倒黑白还会什么", "你真的恶心到我了你这个不要脸皮的下贱痞子货"));

   public void onUpdate() {
      if (this.waited++ >= (Integer)this.delay.getValue()) {
         this.waited = 0;
         ArrayList<String> strings = new ArrayList(penshen);
         if ((Boolean)this.bad.getValue()) {
            strings.addAll(this.badWords);
         }

         String phrase;
         for(phrase = (String)strings.get((int)(Math.random() * (double)strings.size())); phrase.equalsIgnoreCase(this.lastMeme) || phrase.equalsIgnoreCase(this.lastMeme2) || phrase.equalsIgnoreCase(this.lastMeme3) || phrase.equalsIgnoreCase(this.lastMeme4) || phrase.equalsIgnoreCase(this.lastMeme5); phrase = (String)strings.get((int)(Math.random() * (double)strings.size()))) {
         }

         if ((Boolean)this.antiSpam.getValue()) {
            Random random = new Random();
            int nextInt = random.nextInt(16777216);
            String hex = String.format("#%06x", nextInt);
            phrase = phrase + " [" + hex + "]";
         }

         MessageBus.sendServerMessage(phrase);
         this.lastMeme = this.lastMeme2;
         this.lastMeme2 = this.lastMeme3;
         this.lastMeme3 = this.lastMeme4;
         this.lastMeme4 = this.lastMeme5;
         this.lastMeme5 = phrase;
      }
   }
}
